tutorials/incompressible/icoFoam/mixingPlane/twoBlocksMixingPlane_dirZ_spanY/constant/RASProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      RASProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

RASModel            kEpsilon;

turbulence          on;

printCoeffs         on;

laminarCoeffs
{
}

kEpsilonCoeffs
{
    Cmu              0.09;
    C1               1.44;
    C2               1.92;
    alphaEps         0.76923;
}

RNGkEpsilonCoeffs
{
    Cmu              0.0845;
    C1               1.42;
    C2               1.68;
    alphak           1.39;
    alphaEps         1.39;
    eta0             4.38;
    beta             0.012;
}

realizableKECoeffs
{
    Cmu              0.09;
    A0               4.0;
    C2               1.9;
    alphak           1;
    alphaEps         0.833333;
}

kOmegaSSTCoeffs
{
    alphaK1          0.85034;
    alphaK2          1.0;
    alphaOmega1      0.5;
    alphaOmega2      0.85616;
    gamma1           0.5532;
    gamma2           0.4403;
    beta1            0.0750;
    beta2            0.0828;
    betaStar         0.09;
    a1               0.31;
    c1               10;

    Cmu              0.09;
}

NonlinearKEShihCoeffs
{
    Cmu              0.09;
    C1               1.44;
    C2               1.92;
    alphak           1;
    alphaEps         0.76932;
    A1               1.25;
    A2               1000;
    Ctau1            -4;
    Ctau2            13;
    Ctau3            -2;
    alphaKsi         0.9;
}

LienCubicKECoeffs
{
    C1               1.44;
    C2               1.92;
    alphak           1;
    alphaEps         0.76923;
    A1               1.25;
    A2               1000;
    Ctau1            -4;
    Ctau2            13;
    Ctau3            -2;
    alphaKsi         0.9;
}

QZetaCoeffs
{
    Cmu              0.09;
    C1               1.44;
    C2               1.92;
    alphaZeta        0.76923;
    anisotropic     no;
}

LaunderSharmaKECoeffs
{
    Cmu              0.09;
    C1               1.44;
    C2               1.92;
    alphaEps         0.76923;
}

LamBremhorstKECoeffs
{
    Cmu              0.09;
    C1               1.44;
    C2               1.92;
    alphaEps         0.76923;
}

LienCubicKELowReCoeffs
{
    Cmu              0.09;
    C1               1.44;
    C2               1.92;
    alphak           1;
    alphaEps         0.76923;
    A1               1.25;
    A2               1000;
    Ctau1            -4;
    Ctau2            13;
    Ctau3            -2;
    alphaKsi         0.9;
    Am               0.016;
    Aepsilon         0.263;
    Amu              0.00222;
}

LienLeschzinerLowReCoeffs
{
    Cmu              0.09;
    C1               1.44;
    C2               1.92;
    alphak           1;
    alphaEps         0.76923;
    Am               0.016;
    Aepsilon         0.263;
    Amu              0.00222;
}

LRRCoeffs
{
    Cmu              0.09;
    Clrr1            1.8;
    Clrr2            0.6;
    C1               1.44;
    C2               1.92;
    Cs               0.25;
    Ceps             0.15;
    alphaEps         0.76923;
}

LaunderGibsonRSTMCoeffs
{
    Cmu              0.09;
    Clg1             1.8;
    Clg2             0.6;
    C1               1.44;
    C2               1.92;
    C1Ref            0.5;
    C2Ref            0.3;
    Cs               0.25;
    Ceps             0.15;
    alphaEps         0.76923;
    alphaR           1.22;
}

SpalartAllmarasCoeffs
{
    alphaNut         1.5;
    Cb1              0.1355;
    Cb2              0.622;
    Cw2              0.3;
    Cw3              2;
    Cv1              7.1;
    Cv2              5.0;
}

wallFunctionCoeffs
{
    kappa            0.4187;
    E                9;
}

// ************************************************************************* //
